{
  "nintendo" : {
    "bannerSrc": "nintendo_banner",
    "extract": "The Nintendo Company, Ltd. is a Japanese multinational consumer electronics and video game company headquartered in Kyoto. The company was founded in 1889 as Nintendo Karuta by craftsman Fusajiro Yamauchi and originally produced handmade hanafuda playing cards. After venturing into various lines of business during the 1960s and acquiring a legal status as a public company under the current company name, Nintendo distributed its first video game console, the Color TV-Game, in 1977. It gained international recognition with the release of the Nintendo Entertainment System in 1985.",
    "facts": [
      "As a onetime manufacturer of simple diversions like cards and other hand-held items, Nintendo was widely thought to have chosen its name as a reference to good fortune: “leave luck to heaven” was one common interpretation. (Nin means “let someone do,” while do can mean a temple or sanctuary.) But since no archival material from their inception survived, no one can be completely certain what founder Fusajiro Yamauchi had in mind. Hiroshi Yamauchi, the Nintendo president who passed away in 2013, once said that while the explanation was a reasonable guess, even he had no real idea what “Nintendo” was in reference to.",
      "Nintendo’s pre-video game pursuits have been well-documented: the company tried everything from “love tester” machines to taxi services. Their strangest detour, however, may have been in the marketing of instant rice, which was part of some unique expansion efforts in the 1960s. Nintendo even tried peddling a vacuum cleaner before realizing the distribution relationships from their playing card history made them an ideal resource for toys and games, not small appliances and boxed food.",
      "Once Nintendo settled on a direction—exploring the exploding arcade and home game industry—they had a burst of success with Duck Hunt, a contraption that projected targets onto a wall and made them assailable with a solar cell built into a light gun (renamed the “Zapper” for home use in the 1980s). The popularity of Hunt as well as cabinet-style games encouraged Nintendo to pursue the home console business, where interchangeable cartridges would ensure players would never grow tired of the same title. (Or fowl.)",
      "After launching their Famicom (“Family Computer”) in Japan in 1983, Nintendo considered partnering with Atari to distribute the console in America under the Nintendo Entertainment System (NES) name—but Atari’s financial crash gave their brand a scarlet letter, leaving many retailers selling their product at a loss. To combat the widespread video game resentment that followed, Nintendo of America (NOA) decided to market the NES as a home entertainment system. They included the Zapper and a robot named R.O.B. that would react to the action onscreen. In reality, R.O.B. was prone to malfunctioning and only worked with two titles, but his presence was enough to convince both stores and consumers that this wasn’t another bust. The ploy worked: After a successful test market in the northeast in 1985 and 1986, sales of the NES soared to over 6 million (along with 33 million games sold) in 1988.",
      "Legendary Nintendo game designer Shigeru Miyamoto drafted an iconic game character in Mario, the plumber (and occasional referee/doctor/race car driver) who saves damsels in distress in Donkey Kong and his own Mario Bros. series. But his look wasn't solely the result of artistic inspiration. The familiar mustache and hat were added because the technology of the era allowed for so few pixels onscreen; with his white gloves, a player could see his arms move; a hat covered up hair that couldn’t be adequately rendered.",
      "The Captain Nintendo Hotline was an 800 number service that provided tips, but the overwhelming number of calls forced Nintendo to convert it into a 900 toll service by 1990. Game “counselors” could talk kids through difficult spots, but also found themselves being asked questions about school or—in the case of older gamers—marriage issues. The company eventually capped calls at seven minutes to avoid inadvertent therapy sessions.",
      "Nintendo Power was the company’s direct-to-consumer subscription magazine that hyped new releases, provided strategy guides, and gave players a sense of community spirit at a time mainstream publications weren’t paying much attention to the industry. While they were happy to celebrate accomplishments in a high-score section, editors eventually had to prohibit Apple co-founder Steve Wozniak from submitting his record achievements in Tetris because they couldn’t keep printing his name month after month. (Wozniak obliged, but not before submitting one last screen shot as 'Evets Kainzow,' his name spelled backward.)",
      "The National Academy of Television Arts and Sciences isn’t above recognizing achievements outside of sitcoms and fictional ‘60s ad agencies. In 2007, they bestowed a (belated) Technological and Engineering Emmy Award on Nintendo for their “D-pad” innovation, the directional button that replaced the joy stick in home game systems.",
      "Nintendo of America operates out of Redmond, Washington, and the building’s design accents are what you’d expect from the House Mario Built. Bathroom signs have silhouettes of the plumber and his princess; conference rooms are named after Zelda and other Nintendo game characters; benches in the lobby are shaped like the D-pads, although that appears to have been simply a happy coincidence. The furniture provider didn’t do it on purpose.",
      "The coming years will see a series of Nintendo-themed amusement park additions popping up around the globe. In addition to locations at Universal Studios in Orlando, Florida and Hollywood, California, fans will also be able to visit Universal Studios in Osaka, Japan, where guests will purportedly be able to enter a Mario landscape through--what else--a green pipe. The Osaka location could be open as early as 2020."
    ],
    "stats" : [
      "Nintendo Switch sold 7.63 million units worldwide in 2017.",
      "Nintendo DS is Nintendo’s most sold product worldwide with 154.02 million units moved.",
      "Mario Kart 8 Deluxe is the most sold game on Nintendo Switch with over 19 million units.",
      "Nintendo Wii is the fifth highest-selling console of all time with 101.64 million copies distributed worldwide.",
      "Nintendo Switch accounts for 85% of Nintendo’s yearly revenue."
    ]
  },
  "xbox" : {
    "bannerSrc" : "xbox_banner",
    "extract": "Xbox is a video gaming brand created and owned by Microsoft. It represents a series of video game consoles developed by Microsoft, with three consoles released in the sixth, seventh, and eighth generations, respectively. The brand also represents applications (games), streaming services, an online service by the name of Xbox Live, and the development arm by the name of Xbox Game Studios. The brand was first introduced in the United States in November 2001, with the launch of the original Xbox console.",
    "facts": [
      "The logo and branding are green because that was the only colour the designer, Horace Luke, had available after all his nice marker pens were stolen - at least according to Seamus Blackley. Apparently it was 'the green nobody wanted'.",
      "Pitching the original Xbox was a shaky business especially if companies don't believe it's a real product. Apparently, EA wanted to call Microsoft when Blackley arrived to talk to them to 'make sure there was an adult' who knew about the idea of a Microsoft games console.",
      "Originally, Microsoft didn't think Halo would be Xbox's breakout success. That honour goes to Oddworld: Munch's Oddysee, the third in Lorne Lanning's belch-obsessed alien saga. Blackley also brought up Malice, the Gwen Stefani-fronted action-platformer - which Phil Spencer seemed to have forgotten ever came out at all.",
      "Bungie wasn't very happy about Halo on Xbox. In fact, Jason Jones was apparently furious that Blackley had 'screwed up his plan to make this awesome Mac game'.",
      "The original Xbox's hard drive was a source of contention. Seamus Blackley apparently threatened to quit if the (hugely expensive) hard drive inside his machine was removed - but he also had to promise to stop complaining about the enormous Duke controller, which he despised.",
      "Blackley admits this could be apocryphal but here's his take on the genesis of the massive gamepad: 'Somebody's, like, brother-in-law had an electronics design firm... and they had designed the internal circuitboard for a controller with the features we wanted... but the circuitboard was the size of a large dinnerplate.'",
      "Blackley might have promised not to complain about the controller, but that didn't mean he couldn't get others to do it for him. He secretly canvassed Japanese developers, and received so many requests for a smaller controller that he had to create an Excel spreadsheet.",
      "The original Xbox announcement was a bit of a shock for some. The original Xbox was designed all the way down the line alongside processor manufacturer, AMD. However, two days before the reveal, the decision was made to switch to Intel - and some AMD representatives only found out in the crowd on the day of truth. 'I could see all the AMD guys looking like they're going to kill themselves', recalls Blackley.",
      "To plan for how to release alongside the PS3, Peter Moore recalls 'wargaming' a scenario with the 360 team. He played Ken Kutaragi, with the sole aim of destroying the 360 launch. They failed to include Nintendo, who, as Phil Spencer puts it 'destroyed both of us [Microsoft and Sony]' with the Wii.",
      "There's a conspiracy theory about original Xbox's failure in Japan. Xbox has always had a hard time out east. After the bafflement at the Duke controller, a rumour went around that the disc drive would slightly scratch discs as it ran - something Peter Moore says he thinks is down to 'industrial espionage'. Perhaps wisely, he won't say more on the subject."
    ],
    "stats" : [
      "2.5 billion is the number of gamers on a global scale. ",
      "In 2019, the gaming industry generated $152.1 billion.",
      "Xbox Live reached 65 million users monthly in 2020.",
      "Xbox One sales amounted to 51.51 million units in 2020.",
      "Xbox Series X will be released on the 26th of November 2020"
    ]
  }
}